In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from numpy import ndarray

In [2]:
data = pd.read_csv("population_data")

In [3]:
data.head()

      Age Group  Year    Males  Females
0  0 to 4 years  1971  938,835  897,314
1           NaN  1972  921,965  879,950
2           NaN  1973  916,686  871,480
3           NaN  1974  911,727  865,968
4           NaN  1975  908,801  862,260

In [4]:
data.rename(columns={
    'Age Group': "Age",
    'Year': "Year",
    'Males': "Males", 
    'Females':"Females"},inplace=True)

In [5]:
data.Age = data.Age.fillna(method="ffill")

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 918 entries, 0 to 917
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Age      918 non-null    object
 1   Year     918 non-null    int64
 2   Males    918 non-null    object
 3   Females  918 non-null    object
dtypes: int64(1), object(3)
memory usage: 28.8+ KB

In [7]:
data.Males = data.Males.str.replace(",","")
data.Females = data.Females.str.replace(",","")

In [8]:
data.Males = data.Males.astype(int)
data.Males = data.Females.astype(int)

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 918 entries, 0 to 917
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Age      918 non-null    object
 1   Year     918 non-null    int64
 2   Males    918 non-null    int32
 3   Females  918 non-null    object
dtypes: int32(1), int64(1), object(2)
memory usage: 25.2+ KB

In [10]:
data.head(10)

            Age  Year   Males Females
0  0 to 4 years  1971  897314  897314
1  0 to 4 years  1972  879950  879950
2  0 to 4 years  1973  871480  871480
3  0 to 4 years  1974  865968  865968
4  0 to 4 years  1975  862260  862260
5  0 to 4 years  1976  857116  857116
6  0 to 4 years  1977  858401  858401
7  0 to 4 years  1978  861724  861724
8  0 to 4 years  1979  867487  867487
9  0 to 4 years  1980  872638  872638

In [11]:
year_list: ndarray  = data.Year.unique()
year_list

array([1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981,
       1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992,
       1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003,
       2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014,
       2015, 2016, 2017, 2018, 2019, 2020, 2021], dtype=int64)

In [12]:
age_group_list: ndarray = data.Age.unique()
age_group_list

array(['0 to 4 years', '5 to 9 years', '10 to 14 years', '15 to 19 years',
       '20 to 24 years', '25 to 29 years', '30 to 34 years',
       '35 to 39 years', '40 to 44 years', '45 to 49 years',
       '50 to 54 years', '55 to 59 years', '60 to 64 years',
       '65 to 69 years', '70 to 74 years', '75 to 79 years',
       '80 to 84 years', '85 to 89 years'], dtype=object)